#include <iostream>
using namespace std;

int main()
{
  // 这是一个注释
  cout << "Hello World!"; // 这是一个注释

  /* 这是注释 */

  /* C++ 注释也可以
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   * 跨行
   */
  cout << "Hello World!"; // 这是一个注释

  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  // 这是一个注释
  cout << "Hello World!"; // 这是一个注释
  return 0;
}